{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "lbo",
    "1": "bo",
    "2": "co",
    "3": "gr",
    "4": "cgr",
    "5": "mcgr",
    "6": "mgr",
    "7": "fmgr",
    "8": "fgr",
    "9": "sa",
    "10": "csa",
    "11": "mcsa",
    "12": "msa",
    "13": "fmsa",
    "14": "fsa",
    "15": "si",
    "16": "cl",
    "17": "pt",
    "18": "or_",
    "19": "hu",
    "20": "an",
    "21": "ba",
    "22": "oth",
    "23": "ns"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "an": 20,
    "ba": 21,
    "bo": 1,
    "cgr": 4,
    "cl": 16,
    "co": 2,
    "csa": 10,
    "fgr": 8,
    "fmgr": 7,
    "fmsa": 13,
    "fsa": 14,
    "gr": 3,
    "hu": 19,
    "lbo": 0,
    "mcgr": 5,
    "mcsa": 11,
    "mgr": 6,
    "msa": 12,
    "ns": 23,
    "or_": 18,
    "oth": 22,
    "pt": 17,
    "sa": 9,
    "si": 15
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.55.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 105879
}
