{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "kA",
    "1": "Unconsolidated",
    "2": "Amphibolite",
    "3": "Migmatite",
    "4": "Andesite",
    "5": "Aplite",
    "6": "Basalt",
    "7": "Basanite",
    "8": "Bentonite",
    "9": "Claystone",
    "10": "Breccia",
    "11": "Rock",
    "12": "Rhyolite",
    "13": "Psephite",
    "14": "Tuffite",
    "15": "Cataclastite",
    "16": "Pelite",
    "17": "Conglomerate",
    "18": "Dacite",
    "19": "Diorite",
    "20": "Monzonite",
    "21": "Dolostone",
    "22": "Eclogite",
    "23": "Evaporite",
    "24": "Foidite",
    "25": "Foidolite",
    "26": "Gabbro",
    "27": "Mylonite",
    "28": "Gneiss",
    "29": "Granite",
    "30": "Granodiorite",
    "31": "Granulite",
    "32": "Psammite",
    "33": "Schist",
    "34": "Syenite",
    "35": "Granofels",
    "36": "Peridotite",
    "37": "Pyroxenite",
    "38": "Granophyre",
    "39": "Hornfels",
    "40": "Ignimbrite",
    "41": "Kakirite",
    "42": "Latite",
    "43": "Limestone",
    "44": "Marble",
    "45": "Marlstone",
    "46": "Phyllite",
    "47": "Pegmatite",
    "48": "Siltstone",
    "49": "Serpentinite",
    "50": "Phonolite",
    "51": "Prasinite",
    "52": "Sandstone",
    "53": "Pseudotachyllite",
    "54": "Quartzite",
    "55": "Rauwacke",
    "56": "Rodingite",
    "57": "Tonalite",
    "58": "Tephrite",
    "59": "Trachyte"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Amphibolite": 2,
    "Andesite": 4,
    "Aplite": 5,
    "Basalt": 6,
    "Basanite": 7,
    "Bentonite": 8,
    "Breccia": 10,
    "Cataclastite": 15,
    "Claystone": 9,
    "Conglomerate": 17,
    "Dacite": 18,
    "Diorite": 19,
    "Dolostone": 21,
    "Eclogite": 22,
    "Evaporite": 23,
    "Foidite": 24,
    "Foidolite": 25,
    "Gabbro": 26,
    "Gneiss": 28,
    "Granite": 29,
    "Granodiorite": 30,
    "Granofels": 35,
    "Granophyre": 38,
    "Granulite": 31,
    "Hornfels": 39,
    "Ignimbrite": 40,
    "Kakirite": 41,
    "Latite": 42,
    "Limestone": 43,
    "Marble": 44,
    "Marlstone": 45,
    "Migmatite": 3,
    "Monzonite": 20,
    "Mylonite": 27,
    "Pegmatite": 47,
    "Pelite": 16,
    "Peridotite": 36,
    "Phonolite": 50,
    "Phyllite": 46,
    "Prasinite": 51,
    "Psammite": 32,
    "Psephite": 13,
    "Pseudotachyllite": 53,
    "Pyroxenite": 37,
    "Quartzite": 54,
    "Rauwacke": 55,
    "Rhyolite": 12,
    "Rock": 11,
    "Rodingite": 56,
    "Sandstone": 52,
    "Schist": 33,
    "Serpentinite": 49,
    "Siltstone": 48,
    "Syenite": 34,
    "Tephrite": 58,
    "Tonalite": 57,
    "Trachyte": 59,
    "Tuffite": 14,
    "Unconsolidated": 1,
    "kA": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.52.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 105879
}
